{
  "class": {
    "Alchemist": {
      "1": "Alchemists ignore collision and never stop moving."
    },
    "Assassin": {
      "3": "+75% crit damage and +10% crit chance.",
      "6": "+150% crit damage and +20% crit chance."
    },
    "Avatar": {
      "1": "Avatar's Origin Element is counted twice for Trait bonuses."
    },
    "Berserker": {
      "3": "Berserkers have a 45% chance to hit units in cone in front of them and apply on-hit effects.",
      "6": "Berserkers hit units in cone in front of them, apply on-hit effects, and have +25 attack damage."
    },
    "Blademaster": {
      "2": "40% chance to trigger 1 additional attack against their target.",
      "4": "40% chance to trigger 2 additional attacks against their target.",
      "6": "40% chance to trigger 3 additional attacks against their target."
    },
    "Druid": {
      "2": "Druids regenerate 40 health each second."
    },
    "Mage": {
      "3": "Mages have a 50% chance cast an additional time.",
      "6": "Mages have a 100% chance cast an additional time."
    },
    "Mystic": {
      "2": "Allies gain 40 bonus magic resistance.",
      "4": "Allies gain 120 bonus magic resistance."
    },
    "Predator": {
      "3": "Predators instantly kill enemies they damage who are below 25% health."
    },
    "Ranger": {
      "2": "Rangers have a 35% chance to gain x2 attack speed for 3 seconds every 3 seconds.",
      "4": "Rangers have a 80% chance to gain x2 attack speed for 3 seconds every 3 seconds.",
      "6": "Rangers x2.5 attack speed."
    },
    "Soulbound": {
      "2": "The first Soulbound champion to die will instead continue to fight until all other Soulbound champions are dead."
    },
    "Summoner": {
      "3": "Summoned units gain +30% bonus health and last longer.",
      "6": "Summoned units gain +120% bonus health and last longer."
    },
    "Warden": {
      "2": "Wardens gain increased +125% armor.",
      "4": "Wardens gain increased +275% armor.",
      "6": "Wardens gain increased +450% armor."
    }
  },
  "origin": {
    "Cloud": {
      "2": "All allies have a 20% chance to dodge enemy basic attacks.",
      "3": "All allies have a 25% chance to dodge enemy basic attacks.",
      "4": "All allies have a 35% chance to dodge enemy basic attacks."
    },
    "Crystal": {
      "2": "Crystal units take a maximum of 100 damange from a single attack or ability hit.",
      "4": "Crystal units take a maximum of 60 damange from a single attack or ability hit."
    },
    "Desert": {
      "2": "Reduce each enemy's armor by 50%.",
      "4": "Reduce each enemy's armor by 90%."
    },
    "Electric": {
      "2": "Electric units shock nearby enemies for 100 damage whenever they deal or receive a critical strike.",
      "3": "Electric units shock nearby enemies for 300 damage whenever they deal or receive a critical strike.",
      "4": "Electric units shock nearby enemies for 500 damage whenever they deal or receive a critical strike."
    },
    "Glacial": {
      "2": "Glacial units basic attacks have a 20% chance to stun their target for 1.5 seconds on-hit.",
      "4": "Glacial units basic attacks have a 40% chance to stun their target for 1.5 seconds on-hit.",
      "6": "Glacial units basic attacks have a 60% chance to stun their target for 1.5 seconds on-hit."
    },
    "Inferno": {
      "3": "Inferno spells and crits burn 1 hex beneath damage targets, dealing 70% of the spell's damage over 4 seconds.",
      "6": "Inferno spells and crits burn 3 hexes beneath damage targets, dealing 120% of the spell's damage over 4 seconds.",
      "9": "Inferno spells and crits burn 5 hexes beneath damage targets, dealing 180% of the spell's damage over 4 seconds."
    },
    "Light": {
      "3": "When a Light unit dies, all other Light units gain +15% attack speed and heal 25% of the dead unit's maximum health.",
      "6": "When a Light unit dies, all other Light units gain +25% attack speed and heal 25% of the dead unit's maximum health.",
      "9": "When a Light unit dies, all other Light units gain +35% attack speed and heal 25% of the dead unit's maximum health."
    },
    "Lunar": {
      "2": "Every 7 seconds, your team gains 15% Critical Strike Chance and Damage, and 10% Spell Power. (Stacks up to 4 times)."
    },
    "Mountain": {
      "2": "At the start of combat, a random ally gains a 1500 health stoneshield."
    },
    "Ocean": {
      "2": "All allies restore +15 mana every 4 seconds.",
      "4": "All allies restore +30 mana every 4 seconds.",
      "6": "All allies restore +60 mana every 4 seconds."
    },
    "Poison": {
      "3": "Poison units apply Neurotoxin when they deal damage, increasing the mana cost of the target's spell by 50%."
    },
    "Shadow": {
      "3": "Shadow units deal +70% increased damage for 4 seconds at combat start, refreshed on self takedown.",
      "6": "Shadow units deal +140% increased damage for 4 seconds at combat start, refreshed on any Shadow unit takedown."
    },
    "Steel": {
      "2": "Steel units gain damage immunity for a 2 seconds when they are reduced below 50% health.",
      "3": "Steel units gain damage immunity for a 3 seconds when they are reduced below 50% health.",
      "4": "Steel units gain damage immunity for a 4 seconds when they are reduced below 50% health."
    },
    "Woodland": {
      "3": "At the start of combat, a random Woodland champion makes a copy of themselves (excluding items)."
    },
    "Variable": {
      "1": "At the start of the game, gain the element of the board."
    }
  }
}